spec/dummy/app/models/user.rb

  def self.all_with_neewom(form)
    all.map { |user| user.neewom(form) }
---
SELECT "users".* FROM "users"