spec/dummy/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @collection = User.all.map { |user| user.neewom_view(:name, :role) }